Revit 2027 API
BuiltInFailures.AutoRouteFailures.DistributionTypeInvalid Property
 Selected distribution system type is invalid!
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DistributionTypeInvalid { get; }
Public Shared ReadOnly Property DistributionTypeInvalid As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DistributionTypeInvalid {
	FailureDefinitionId^ get ();
}
static member DistributionTypeInvalid : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace